docs/mathematics/single_variable_calculus/KBe21math401refQuizPrep.tex
% Created 2021-09-12 Sun 22:50
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{Quiz Prep}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={Quiz Prep},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Derivatives}
\label{sec:org872f97d}
\subsection{Common}
\label{sec:orgaec09ad}
\begin{center}
\begin{tabular}{ll}
function & derivative\\
\hline
\(\sin x\) & \(\cos x\)\\
\(\cos x\) & \(-\sin x\)\\
\(\tan x\) & \(\frac{1}{sin^2 x}\)\\
\(\sin x^-\) & \(\frac{1}{\sqrt{1-x}}\)\\
\(\cos x^-\) & \(\frac{-1}{\sqrt{1-x}}\)\\
\(\tan x^-\) & \(\frac{1}{1+x^2}\)\\
\hline
\(a^x\) & \(\ln(a) a^x\)\\
\(\log_a x\) & \(\frac{1}{\ln(a) x}\)\\
 & \\
\end{tabular}
\end{center}


\subsection{Rules}
\label{sec:orgecfdff6}
\subsubsection{Add/Subtract}
\label{sec:org28169fd}
\[ \frac{d}{dx} f(x) + g(x) = \frac{d}{dx} f(x) + \frac{d}{dx} g(x) \]
\subsubsection{Multiply}
\label{sec:org0c1a459}
\[ \frac{d}{dx} \left(f(x) g(x)\right) = \left(\frac{d}{dx} f(x)\right) g(x) + f(x)\left( \frac{d}{dx}g(x)\right) \]
\subsubsection{Divide}
\label{sec:org9202c0d}
\[ \frac{d}{dx} \frac{f(x)}{g(x)} = \frac{g(x)\frac{d}{dx}f(x) - f(x) \frac{d}{dx} g(x) }{g^2(x)} \]
\subsubsection{Chain Rule}
\label{sec:org834ca70}

\[ \frac{d}{dx} f(g(x)) = \left(\frac{d}{dx} f\right)(g(x))\left(\frac{d}{dx} g(x)\right) \]
\subsubsection{Power Rule (ONLY TAKE OUT CONST MULTIPLES)}
\label{sec:org966554c}
\[ \frac{d}{dx} x^n = nx^{n-1} \]

\section{Approximation}
\label{sec:org61649ab}
\subsection{Linear Approximation at a Point}
\label{sec:orgcd35da9}
\[ y = f(a) + f'(a)(x-a) \]
(First order taylor series)
\subsection{Differentials}
\label{sec:org2749451}
\[ dy = f'(x)dx \]
Basically use the slope of the linear approximation to approximate the change (\(dy\)) in the function given a change an \(x\) (\(dx\)).

\section{Implicit Differentiation}
\label{sec:org71568fe}

REMEMBER that \(y\) is \(f(x)\) which means it's a function of \(x\)! Use the chain rule!

Then solve for \(f'(x)\) and if necessary, plug in the original definition of \(f(x)\).

Use point slope form to find tangent lines.

\section{Derivative of Inverse Functions}
\label{sec:orgd8f5b8a}

\[ f^{-}'(x) = \frac{1}{f'\left(f^-(x)\right)} \]
\end{document}
